In [2]:
import pandas as pd
import numpy as np

import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
pd.set_option('display.max_columns', None)

## Exploración Customer Flight Activity

In [4]:
df_f = pd.read_csv("../data/Customer Flight Activity.csv")

In [5]:
df_f.head()

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
0,100018,2017,1,3,0,3,1521,152.0,0,0
1,100102,2017,1,10,4,14,2030,203.0,0,0
2,100140,2017,1,6,0,6,1200,120.0,0,0
3,100214,2017,1,0,0,0,0,0.0,0,0
4,100272,2017,1,0,0,0,0,0.0,0,0

In [7]:
df_f.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 405624 entries, 0 to 405623
Data columns (total 10 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Loyalty Number               405624 non-null  int64
 1   Year                         405624 non-null  int64
 2   Month                        405624 non-null  int64
 3   Flights Booked               405624 non-null  int64
 4   Flights with Companions      405624 non-null  int64
 5   Total Flights                405624 non-null  int64
 6   Distance                     405624 non-null  int64
 7   Points Accumulated           405624 non-null  float64
 8   Points Redeemed              405624 non-null  int64
 9   Dollar Cost Points Redeemed  405624 non-null  int64
dtypes: float64(1), int64(9)
memory usage: 30.9 MB

En cuanto al tipo de dato que contiene las columnas, parecen correctas.

In [8]:
df_f.shape

(405624, 10)

In [11]:
df_f.describe().T

,count,mean,std,min,25%,50%,75%,max
Loyalty Number,405624.0,550037.873084,258935.286969,100018.0,326961.00,550834.0,772194.00,999986.0
Year,405624.0,2017.500000,0.500001,2017.0,2017.00,2017.5,2018.00,2018.0
Month,405624.0,6.500000,3.452057,1.0,3.75,6.5,9.25,12.0
Flights Booked,405624.0,4.115052,5.225518,0.0,0.00,1.0,8.00,21.0
Flights with Companions,405624.0,1.031805,2.076869,0.0,0.00,0.0,1.00,11.0
Total Flights,405624.0,5.146858,6.521227,0.0,0.00,1.0,10.00,32.0
Distance,405624.0,1208.880059,1433.155320,0.0,0.00,488.0,2336.00,6293.0
Points Accumulated,405624.0,123.692721,146.599831,0.0,0.00,50.0,239.00,676.5
Points Redeemed,405624.0,30.696872,125.486049,0.0,0.00,0.0,0.00,876.0
Dollar Cost Points Redeemed,405624.0,2.484503,10.150038,0.0,0.00,0.0,0.00,71.0

- **Flights booked:** Media y mediana, máximos y mínimos alejados. Algo normal, hay personas que pueden no reservar ningún vuelo anualmente y otras que reserven varios, además una misma persona puede encargarse de reservar los vuelos de varias personas a la vez, por lo que subiría esa media.
- **Flights with Companions:** Me llama la atención que el máximo de acompañantes sea tan alto y que la mayoría de personas viajen solas. Puede indicar que las personas que más viajan lo hacen por trabajo (suposición)
- **Total flights:** Media y mediana alejadas. Algo razonable, hay personas que pueden no coger ningún vuelo anualmente y otras que cojan varios. El mínimo, máximo, etc reflejan y confirman esto. 
- **Distance:** Alta. Normal en vuelos.

In [19]:
df_f.isna().sum()/df_f.shape[0]*100

Loyalty Number                 0.0
Year                           0.0
Month                          0.0
Flights Booked                 0.0
Flights with Companions        0.0
Total Flights                  0.0
Distance                       0.0
Points Accumulated             0.0
Points Redeemed                0.0
Dollar Cost Points Redeemed    0.0
dtype: float64

No hay nulos

In [24]:
df_f.duplicated().sum()

np.int64(1864)

Valores duplicados. Al ser todos valores numéricos, en principio, es norma

In [31]:
df_f.duplicated(subset="Loyalty Number").sum()

np.int64(388887)

In [35]:
df_f[df_f.duplicated(subset="Loyalty Number", keep=False)].sort_values("Loyalty Number").head(10)

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
257159,100018,2018,3,7,0,7,1876,280.5,0,0
257382,100018,2018,2,6,0,6,1824,273.0,0,0
321119,100018,2018,8,0,0,0,0,0.0,0,0
185911,100018,2017,12,6,0,6,1908,190.0,0,0
270416,100018,2018,5,0,0,0,0,0.0,0,0
16901,100018,2017,2,2,2,4,1320,132.0,0,0
50703,100018,2017,4,4,0,4,924,92.0,0,0
142774,100018,2017,8,10,5,15,4200,420.0,690,56
388723,100018,2018,12,17,6,23,4945,494.0,0,0
267063,100018,2018,4,5,0,5,2590,388.5,0,0

In [57]:
df_f[(df_f.duplicated(subset="Loyalty Number", keep=False)) & (df_f["Loyalty Number"] == 100018)]

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,Booked_le_Total
0,100018,2017,1,3,0,3,1521,152.0,0,0,True
16901,100018,2017,2,2,2,4,1320,132.0,0,0,True
46353,100018,2018,10,6,4,10,3110,311.0,385,31,True
50703,100018,2017,4,4,0,4,924,92.0,0,0,True
67604,100018,2017,5,0,0,0,0,0.0,0,0,True
84505,100018,2017,6,4,1,5,4330,433.0,0,0,True
101406,100018,2017,7,10,0,10,3870,387.0,0,0,True
135208,100018,2017,9,9,4,13,1651,165.0,0,0,True
142774,100018,2017,8,10,5,15,4200,420.0,690,56,True
152109,100018,2017,10,6,0,6,1032,103.0,0,0,True
169010,100018,2017,11,13,1,14,3374,337.0,0,0,True
185911,100018,2017,12,6,0,6,1908,190.0,0,0,True
202812,100018,2018,1,1,0,1,312,31.0,0,0,True
213311,100018,2017,3,14,3,17,2533,253.0,438,36,True
257159,100018,2018,3,7,0,7,1876,280.5,0,0,True
257382,100018,2018,2,6,0,6,1824,273.0,0,0,True
267063,100018,2018,4,5,0,5,2590,388.5,0,0,True
270416,100018,2018,5,0,0,0,0,0.0,0,0,True
287317,100018,2018,6,0,0,0,0,0.0,0,0,True
304218,100018,2018,7,9,7,16,2736,273.0,0,0,True
321119,100018,2018,8,0,0,0,0,0.0,0,0,True
338020,100018,2018,9,14,2,16,3568,356.0,0,0,True
371822,100018,2018,11,11,0,11,3058,305.0,0,0,True
388723,100018,2018,12,17,6,23,4945,494.0,0,0,True

In [40]:
df_f[(df_f.duplicated(subset="Loyalty Number", keep=False)) & (df_f["Loyalty Number"] == 100018)].count()

Loyalty Number                 24
Year                           24
Month                          24
Flights Booked                 24
Flights with Companions        24
Total Flights                  24
Distance                       24
Points Accumulated             24
Points Redeemed                24
Dollar Cost Points Redeemed    24
dtype: int64

Loyalty number, hay duplicados porque se registra las reservas que hace la persona por mes.

In [43]:
df_f["Loyalty Number"].unique

<bound method Series.unique of 0         100018
1         100102
2         100140
3         100214
4         100272
           ...
405619    999902
405620    999911
405621    999940
405622    999982
405623    999986
Name: Loyalty Number, Length: 405624, dtype: int64>

In [54]:
df_f.groupby("Loyalty Number")[["Total Flights","Flights Booked"]].sum()

                Total Flights  Flights Booked
Loyalty Number
100018                    192             157
100102                    215             173
100140                    190             152
100214                     96              79
100272                    163             127
...                       ...             ...
999902                    225             178
999911                      0               0
999940                     86              63
999982                     24              22
999986                    138             121

[16737 rows x 2 columns]

In [ ]:
df_f.groupby("Loyalty Number")[["Total Flights","Flights Booked"]]

In [55]:
df_f['Booked_le_Total'] = df_f['Flights Booked'] <= df_f['Total Flights']

# Ver cuántos registros cumplen y cuántos no
print(df_f['Booked_le_Total'].value_counts())

Booked_le_Total
True    405624
Name: count, dtype: int64

In [ ]:
def datos_df (dataframe):
    for columna in df: 
        print(df[columna].shape)

### CONCLUSIONES DE CARA A EXPLORAR EN VISUALIZACIÓN:
- Indicadores de sesgo positivo en las métricas, explorar mediante histograma y boxplots. 
- Rangos máximos muy altos. Hay que revisar mediante visualizaciones.

In [58]:
df_l = pd.read_csv("../data/Customer Loyalty History.csv")

In [64]:
df_l.head()

,Loyalty Number,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN
1,549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
2,429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.0,1.0
3,608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
4,530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,NaN,NaN

In [60]:
def eda(dataframe):
    """
    Función para hacer un análisis exploratorio rápido de un DataFrame.
    
    Devuelve:
    - shape
    - info
    - estadísticas descriptivas transpuestas
    - % de valores nulos por columna
    - número de duplicados totales
    """
    
    print("🔹 SHAPE:")
    print(dataframe.shape)
    print("\n🔹 INFO:")
    print(dataframe.info())
    print("\n🔹 DESCRIBE:")
    print(dataframe.describe().T)
    
    # Porcentaje de nulos
    print("\n🔹 % NULOS POR COLUMNA:")
    nulos_pct = (dataframe.isna().sum() / dataframe.shape[0] * 100).round(2)
    print(nulos_pct)
    
    # Duplicados
    print("\n🔹 DUPLICADOS TOTALES:")
    print(dataframe.duplicated().sum())
    
    return dataframe.shape, dataframe.info(), dataframe.describe().T, nulos_pct, dataframe.duplicated().sum()

In [62]:
eda(df_l)

🔹 SHAPE:
(16737, 16)

🔹 INFO:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16737 entries, 0 to 16736
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Loyalty Number      16737 non-null  int64
 1   Country             16737 non-null  object
 2   Province            16737 non-null  object
 3   City                16737 non-null  object
 4   Postal Code         16737 non-null  object
 5   Gender              16737 non-null  object
 6   Education           16737 non-null  object
 7   Salary              12499 non-null  float64
 8   Marital Status      16737 non-null  object
 9   Loyalty Card        16737 non-null  object
 10  CLV                 16737 non-null  float64
 11  Enrollment Type     16737 non-null  object
 12  Enrollment Year     16737 non-null  int64
 13  Enrollment Month    16737 non-null  int64
 14  Cancellation Year   2067 non-null   float64
 15  Cancellation Month  2067 non-null   float64
dtypes: float64(4), int64(3), object(9)
memory usage: 2.0+ MB
None

🔹 DESCRIBE:
                      count           mean            std        min  \
Loyalty Number      16737.0  549735.880445  258912.132453  100018.00
Salary              12499.0   79245.609409   35008.297285  -58486.00
CLV                 16737.0    7988.896536    6860.982280    1898.01
Enrollment Year     16737.0    2015.253211       1.979111    2012.00
Enrollment Month    16737.0       6.669116       3.398958       1.00
Cancellation Year    2067.0    2016.503145       1.380743    2013.00
Cancellation Month   2067.0       6.962748       3.455297       1.00

                          25%        50%        75%        max
Loyalty Number      326603.00  550434.00  772019.00  999986.00
Salary               59246.50   73455.00   88517.50  407228.00
CLV                   3980.84    5780.18    8940.58   83325.38
Enrollment Year       2014.00    2015.00    2017.00    2018.00
Enrollment Month         4.00       7.00      10.00      12.00
Cancellation Year     2016.00    2017.00    2018.00    2018.00
Cancellation Month       4.00       7.00      10.00      12.00

🔹 % NULOS POR COLUMNA:
Loyalty Number         0.00
Country                0.00
Province               0.00
City                   0.00
Postal Code            0.00
Gender                 0.00
Education              0.00
Salary                25.32
Marital Status         0.00
Loyalty Card           0.00
CLV                    0.00
Enrollment Type        0.00
Enrollment Year        0.00
Enrollment Month       0.00
Cancellation Year     87.65
Cancellation Month    87.65
dtype: float64

🔹 DUPLICADOS TOTALES:
0
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16737 entries, 0 to 16736
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Loyalty Number      16737 non-null  int64
 1   Country             16737 non-null  object
 2   Province            16737 non-null  object
 3   City                16737 non-null  object
 4   Postal Code         16737 non-null  object
 5   Gender              16737 non-null  object
 6   Education           16737 non-null  object
 7   Salary              12499 non-null  float64
 8   Marital Status      16737 non-null  object
 9   Loyalty Card        16737 non-null  object
 10  CLV                 16737 non-null  float64
 11  Enrollment Type     16737 non-null  object
 12  Enrollment Year     16737 non-null  int64
 13  Enrollment Month    16737 non-null  int64
 14  Cancellation Year   2067 non-null   float64
 15  Cancellation Month  2067 non-null   float64
dtypes: float64(4), int64(3), object(9)
memory usage: 2.0+ MB

((16737, 16),
 None,
                       count           mean            std        min  \
 Loyalty Number      16737.0  549735.880445  258912.132453  100018.00
 Salary              12499.0   79245.609409   35008.297285  -58486.00
 CLV                 16737.0    7988.896536    6860.982280    1898.01
 Enrollment Year     16737.0    2015.253211       1.979111    2012.00
 Enrollment Month    16737.0       6.669116       3.398958       1.00
 Cancellation Year    2067.0    2016.503145       1.380743    2013.00
 Cancellation Month   2067.0       6.962748       3.455297       1.00

                           25%        50%        75%        max
 Loyalty Number      326603.00  550434.00  772019.00  999986.00
 Salary               59246.50   73455.00   88517.50  407228.00
 CLV                   3980.84    5780.18    8940.58   83325.38
 Enrollment Year       2014.00    2015.00    2017.00    2018.00
 Enrollment Month         4.00       7.00      10.00      12.00
 Cancellation Year     2016.00    2017.00    2018.00    2018.00
 Cancellation Month       4.00       7.00      10.00      12.00  ,
 Loyalty Number         0.00
 Country                0.00
 Province               0.00
 City                   0.00
 Postal Code            0.00
 Gender                 0.00
 Education              0.00
 Salary                25.32
 Marital Status         0.00
 Loyalty Card           0.00
 CLV                    0.00
 Enrollment Type        0.00
 Enrollment Year        0.00
 Enrollment Month       0.00
 Cancellation Year     87.65
 Cancellation Month    87.65
 dtype: float64,
 np.int64(0))

### Notas generales:

- El mínimo de salary está en negativo. Seguir explorando esta columna. 25.32% de nulos
- Cancellation year: 87.65% de nulos, MUY alto.
- Cancellation month: 87.65% de nulos, MUY alto. (igual a year)
- No hay duplicados

In [ ]:
df_l["Salary"]

         Salary Marital Status
0       83236.0        Married
1           NaN       Divorced
2           NaN         Single
3           NaN         Single
4      103495.0        Married
...         ...            ...
16732       NaN        Married
16733   89210.0        Married
16734       NaN         Single
16735  -57297.0        Married
16736   75049.0        Married

[16737 rows x 2 columns]